{
  "messages": [
    "Oops! Looks like the math gods weren’t on your side this time.",
    "Close, but your calculations fell just short!",
    "The answer was elusive this round—try again!",
    "Math isn’t always easy, but you’ll get it next time!",
    "Looks like your numbers didn’t quite add up to a win.",
    "You were close! A few more calculations and you’d have won!",
    "Not this time! But every equation is a learning opportunity.",
    "You didn’t win, but your math skills are still impressive!",
    "The numbers didn’t align in your favor this round.",
    "You’ve got the spirit! Just a bit more practice and you’ll be winning!",
    "Close call! Your math game is strong, but victory slipped away.",
    "Not quite the right formula for a win this time.",
    "The math puzzle wasn’t solved in your favor, but keep at it!",
    "Your calculations were almost perfect—next time will be yours!",
    "The numbers didn’t work out, but don’t let that discourage you!",
    "You’ve got the brainpower—just need a bit more practice!",
    "So close! Your math skills are almost at the winning level.",
    "Unlucky! But remember, every great mathematician has their off days.",
    "You’re one step away from victory—keep crunching those numbers!",
    "A valiant effort, but the math didn’t add up to a win this time.",
    "Math can be tricky—don’t let this loss get you down!",
    "Your calculations were almost there—better luck next time!",
    "Don’t worry, even Einstein had off days! Try again!",
    "You were so close to solving for a win. Keep practicing!",
    "The numbers didn’t quite work out this time, but you’re getting there!",
    "The answer was just out of reach—keep going and you’ll get it!",
    "Almost there! Your math skills are on the right track.",
    "You didn’t win this round, but your math skills are still top-notch.",
    "Looks like your math equation didn’t solve out for a win today.",
    "Close, but not quite! Your math skills are getting stronger.",
    "It’s a tough break this time, but you’ve got the right attitude!",
    "The math didn’t quite add up, but your effort is commendable!",
    "Unlucky this round, but you’re getting closer to victory!",
    "You’re on the right path—just a bit more practice needed!",
    "Your math journey isn’t over—keep honing those skills!",
    "Almost a win! Your math skills are almost unbeatable.",
    "It didn’t work out this time, but keep working on those equations!",
    "You’ve got the drive—just need a bit more math magic next time!",
    "The solution eluded you today, but you’re still a math contender!",
    "Not quite the win you wanted, but your math skills are impressive!",
    "The numbers didn’t favor you this time, but don’t lose hope!",
    "You gave it your best shot—math mastery takes time!",
    "The win slipped through your fingers this time, but keep trying!",
    "A close call! Your math skills are almost at the winning level.",
    "You’ve got the right attitude—just keep working on those numbers!",
    "Not your round, but you’re proving to be a math enthusiast!",
    "So close to victory! Your math skills are evolving.",
    "The answer was just out of reach this time—better luck next round!",
    "You didn’t win this round, but your math skills are on the rise!"
  ]
}
