{
  "messages": [
    "Math wizardry at its finest! You won!",
    "You’ve cracked the code! Victory is yours!",
    "Well-calculated and well-deserved win!",
    "You’ve solved your way to victory!",
    "Math champion alert! You’ve won!",
    "You’ve added another win to your tally!",
    "Pi couldn’t be as perfect as your victory!",
    "Bravo! You’ve multiplied your success!",
    "Your equations led you to triumph!",
    "You’ve divided your way to the top!",
    "Algebra never looked so good—congratulations!",
    "You’ve got the right formula for winning!",
    "You’re the geometry genius of the game!",
    "You’ve squared up to win this round!",
    "Calculus champion! Your victory is well-earned!",
    "You’ve got the exponential edge in this game!",
    "Congrats! Your math skills are on point!",
    "You’ve won by a significant margin—nice work!",
    "Eureka! You’ve solved the problem of winning!",
    "Your math mastery has led you to victory!",
    "You’ve factored in a win—fantastic job!",
    "You’ve overcome the odds with precision!",
    "You’ve made the right calculations for a win!",
    "Fantastic work! You’ve conquered the math challenge!",
    "You’re the algebra ace of the match!",
    "Bravo! Your math skills are a winning formula!",
    "Your math prowess shines bright—congratulations!",
    "You’ve navigated the equations to victory!",
    "You’ve out-calculated the competition—well done!",
    "You’ve hit the jackpot with your math skills!",
    "Your problem-solving skills are second to none!",
    "Great job! Your calculations were spot on!",
    "You’ve excelled with flying numbers!",
    "Your math mastery has prevailed—cheers!",
    "You’ve got the golden ratio of success!",
    "Hats off! Your math game is unbeatable!",
    "You’ve achieved mathematical greatness!",
    "Your success is the sum of hard work and talent!",
    "You’ve graphically illustrated a win!",
    "Fantastic job! Your math skills are exceptional!",
    "You’ve derived the perfect win—congratulations!",
    "You’ve multiplied your success with this win!",
    "Victory was the result of your perfect calculations!",
    "You’ve solved the final equation to win the game!",
    "Your winning streak adds up—well done!",
    "You’ve got the right formula for success!",
    "Kudos! You’ve aced the math challenge!"
  ]
}
